📌 Q2. 파이썬 코딩을 하기에 앞서 하드웨어를 이해하는 것이 중요하다고 했습니다.
       하드웨어 아키텍쳐에서 CPU와 Main Memory 그리고 Secondary Memory의 역할을
       간단하게 정리하여 봅시다.

   A2. 프로그래머는 컴퓨터의 "다음 무엇을 수행할까요?"에 대한 답을 하는 사람입니다.
       따라서 컴퓨터와 "대화"하는 것이 프로그래머의 역할이라고 할 수 있는데,
       중앙처리장치인 CPU(Central Processing Unit)는 비유하자면 인간의 뇌로,
       컴퓨터 시스템을 통제하고 연산을 처리하는 가장 핵심적인 장치입니다.

       이렇듯 컴퓨터에게 수행할 명령문 집합을 작성하면(Programming)
       CPU가 실행하는 것이 하드웨어의 기본적인 원리라고 할 수 있겠습니다.

       또한 주기억장치(Main Memory)는 CPU가 급하게 명령어를 처리하는데 필요한 적은 양의 정보를 저장하는 용도로,
       속도는 매우 빠르지만 종료하면 사라지는 휘발성 메모리입니다. (ex. RAM)

       마지막으로 보조기억장치(Secondary Memory)는 컴퓨터가 종료되어도 정보를 기억하는 용도로
       지우지 않는 이상 정보를 가지고 있는 비휘발성 메모리입니다. (ex. HDD, SSD)

       따라서 프로그램의 실행 원리는
       1) 부팅시켰을 때 컴퓨터의 주기억장치는 공백상태
       2) 보조기억장치에서 운영체제를 주기억장치로 전송
       3) 전송된 운영체제가 다른 응용프로그램을 실행
       이라고 할 수 있겠습니다.
